#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		Представление = Данные.Наименование;
	Иначе
		Представление = СтрШаблон("%1 (Действует на основании %2)", Данные.Наименование, Данные.ДействуетНаОсновании);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти